<!-- add-pr-comment:quicksight_plan -->

# staging/quicksight Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudformation_stack.sms-usage-notifications[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from aws_cloudformation_stack.sms-usage-notifications)
  - resource "aws_cloudformation_stack" "sms-usage-notifications" {
      - disable_rollback   = false -> null
      - id                 = "arn:aws:cloudformation:ca-central-1:239043911459:stack/sms-usage-notifications/fd642d50-f107-11ee-97dd-0eecde249eef" -> null
      - name               = "sms-usage-notifications" -> null
      - notification_arns  = (sensitive value) -> null
      - outputs            = {} -> null
      - parameters         = {} -> null
      - region             = "ca-central-1" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - template_body      = (sensitive value) -> null
      - timeout_in_minutes = 0 -> null
        # (1 unchanged attribute hidden)
    }
  # aws_quicksight_data_set.notifications_athena[0] will be created
  + resource "aws_quicksight_data_set" "notifications_athena" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notifications_athena"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notifications_Athena"
      + output_columns = (known after apply)
      + region         = "ca-central-1"
      + tags_all       = (known after apply)
      + data_set_usage_configuration (known after apply)
      + logical_table_map (known after apply)
      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
        }
      + physical_table_map {
          + physical_table_map_id = "notifications_athena"
          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "vw_notifications"
              + schema          = "notification_quicksight"
                # (1 unchanged attribute hidden)
              + input_columns {
                  + name = "notification_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_billable_units"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notification_created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "notification_sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "notification_updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "notification_queue_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_reference"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "api_key_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_active"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "service_restricted"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "service_research_mode"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "service_count_as_live"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "service_go_live_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "service_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_message_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_rate_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_sms_daily_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "organisation_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "organisation_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "template_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "tc_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_name_en"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_name_fr"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_email_process_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_sms_process_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_sms_sending_vehicle"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "sms_total_message_price"
                  + type = "DECIMAL"
                }
              + input_columns {
                  + name = "sms_total_carrier_fee"
                  + type = "DECIMAL"
                }
              + input_columns {
                  + name = "sms_iso_country_code"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "sms_carrier_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "sms_message_encoding"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "sms_origination_phone_number"
                  + type = "STRING"
                }
            }
          + s3_source (known after apply)
        }
    }
  # aws_quicksight_data_source.athena_source will be created
  + resource "aws_quicksight_data_source" "athena_source" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_source_id = "athena-quicksight-data-source"
      + id             = (known after apply)
      + name           = "AthenaDataSource"
      + region         = "ca-central-1"
      + tags_all       = (known after apply)
      + type           = "ATHENA"
      + parameters {
          + athena {
              + work_group = "Notification_quicksight"
            }
        }
      + permission {
          + actions   = [
              + "quicksight:DeleteDataSource",
              + "quicksight:DescribeDataSource",
              + "quicksight:DescribeDataSourcePermissions",
              + "quicksight:PassDataSource",
              + "quicksight:UpdateDataSource",
              + "quicksight:UpdateDataSourcePermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }
      + ssl_properties (known after apply)
    }
  # aws_quicksight_refresh_schedule.notifications_athena[0] will be created
  + resource "aws_quicksight_refresh_schedule" "notifications_athena" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notifications_athena"
      + id             = (known after apply)
      + region         = "ca-central-1"
      + schedule_id    = "schedule-notifications-athena"
      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)
          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "05:20"
              + timezone        = (known after apply)
            }
        }
    }
  # aws_quicksight_refresh_schedule.sms-usage-notifications[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from aws_quicksight_refresh_schedule.sms-usage-notifications)
  - resource "aws_quicksight_refresh_schedule" "sms-usage-notifications" {
      - arn            = "arn:aws:quicksight:ca-central-1:239043911459:dataset/sms-usage-notifications/refresh-schedule/schedule-sms-usage-notifications" -> null
      - aws_account_id = "239043911459" -> null
      - data_set_id    = "sms-usage-notifications" -> null
      - id             = "239043911459,sms-usage-notifications,schedule-sms-usage-notifications" -> null
      - region         = "ca-central-1" -> null
      - schedule_id    = "schedule-sms-usage-notifications" -> null
      - schedule {
          - refresh_type          = "FULL_REFRESH" -> null
          - start_after_date_time = "2024-04-02T04:08:56" -> null
          - schedule_frequency {
              - interval        = "DAILY" -> null
              - time_of_the_day = "07:45" -> null
              - timezone        = "UTC" -> null
            }
        }
    }
Plan: 3 to add, 0 to change, 2 to destroy.

# --- End of Plan 1 ---